CSI API ETABS v1

# eReturnCode Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eReturnCode

    Public Enumeration eReturnCode

    Dim instance As eReturnCode

    public enum class eReturnCode

    type eReturnCode

Members

| Member name| Value| Description
---|---|---|---
| NotApplicable| -100|
| NotImplemented| -99|
| NoError| 0|
| UnspecifiedError| 1|
| Deprecated| -98|
| TableIsObsolete| -97|
| TableDoesNotExist| -96|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com